// المتغيرات
var x;

x = 'hello ';
x = 'sajjad salam';
document.writeln(x);
// الفيكة ب الجافاسكربت هنا انو حتى اكدر اغير نوع المتغير شوكت ما اريد
// يعني مثلا
document.writeln('<br>');
x = 10;

document.writeln(x); // 10

// الفرق بين
// let === قيمة تتغير
// const === قيمة ثابته ماتكدر تغيرها بعدين
// var === قيمة تتغير

// الفرق بين
// let
// var
// تكدر تسوي فار مرتين عادي ويستقبله المتصفح بس هو اصلا غلط
// يعني مثلا

document.writeln('<br>');
var y = 10;
var y = 20;
//  البرنامج هنا راح يشتغل بدون اخطاء

// لكن let ماتقبل
// let y = 10;
// let y = 20;
// error

// دكلريشن
// معناهة اسناد متغير الى قيمة معينة
